
/*
	TODO: DCLib
	 > выпилить eth-ligthwallet - заменить его на web3
	 - избавиться от RPC - юзать web3
	
	 - написать подпись и валидацию подписи сообщений
	 - заменить мессенджинг на ipfs
	 - итеграция с metamask
	 - написать restore игры
	 - написать UI кошелька 
*/

import DCLib from './DC.lib.js'

window.DCLib = new DCLib()



/*
	TODO: Bankroller
	 - выпилить eth-ligthwallet - заменить его на web3
     - избавиться от RPC - юзать web3
     - написать открытие закрытие каналов
     - написать подпись и валидацию подписи сообщений
     - заменить мессенджинг на ipfs
     - написать ведение статистики игр
     - сделать красивый интерфейс таба разработчика
     - написать деплой игры в ipfs
     - написать установку игры из ipfs
*/


/*
	TODO: Docs
	 - Написать README на github
	 - Оформить кейсы, написать readme по ним выложить на github
	 - Написать документацию на readme.io
	 - снять несколько видео с разрабткой простых игр
	 - написать 1-2 туториала
	 - первести туториалы на английский
	 - сделать лендинг для либы со всем этим добром
*/

/*
 
	TODO: Platform

	Переписать платформу , дайс, желательно ещё и BJ на новую либу 

	!!! Дайс - написать с нуля.

*/





/*
	----------------------------
		After 15.11
	----------------------------

	

*/


