
/*
	TODO: DCLib
	 - написать подпись и валидацию подписи сообщений
	 - заменить мессенджинг на ipfs
	 - итеграция с metamask
	 - написать restore игры
	 - написать UI кошелька 
*/

import DCLib from './DC.lib.js'

window.DCLib = new DCLib()



/*
	TODO: Docs
	 - Написать README на github
	 - Оформить кейсы, написать readme по ним выложить на github
	 - Написать документацию на readme.io
	 - снять несколько видео с разрабткой простых игр
	 - написать 1-2 туториала
	 - первести туториалы на английский
	 - сделать лендинг для либы со всем этим добром
*/
